Lockless_CAS_Optimization/artifact_files/benchmark_results/ordered_opt0_t16_r1_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     1340.93
    fsyncs/s:                     1340.93

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               20.95

General statistics:
    total time:                          10.0071s
    total number of events:              13424

Latency (ms):
         min:                                    5.28
         avg:                                   11.92
         max:                                  142.36
         95th percentile:                       17.95
         sum:                               160047.22

Threads fairness:
    events (avg/stddev):           839.0000/0.00
    execution time (avg/stddev):   10.0030/0.00