Lockless_CAS_Optimization/artifact_files/benchmark_results/ordered_opt0_t32_r1_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 1.5625MiB each
200MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     4810.11
    fsyncs/s:                     4810.11

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               75.16

General statistics:
    total time:                          10.0020s
    total number of events:              48114

Latency (ms):
         min:                                    1.70
         avg:                                    6.64
         max:                                  376.89
         95th percentile:                        5.99
         sum:                               319650.54

Threads fairness:
    events (avg/stddev):           1503.5625/6.37
    execution time (avg/stddev):   9.9891/0.00