Lockless_CAS_Optimization/artifact_files/benchmark_results/ordered_opt1_t4_r3_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     370.51
    fsyncs/s:                     370.51

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               5.79

General statistics:
    total time:                          10.0121s
    total number of events:              3711

Latency (ms):
         min:                                    4.98
         avg:                                   10.78
         max:                                   61.43
         95th percentile:                       13.95
         sum:                                40016.46

Threads fairness:
    events (avg/stddev):           927.7500/0.43
    execution time (avg/stddev):   10.0041/0.00