Lockless_CAS_Optimization/artifact_files/benchmark_results/ordered_opt1_t8_r2_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     712.42
    fsyncs/s:                     712.42

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               11.13

General statistics:
    total time:                          10.0141s
    total number of events:              7137

Latency (ms):
         min:                                    4.78
         avg:                                   11.22
         max:                                   92.39
         95th percentile:                       15.83
         sum:                                80065.99

Threads fairness:
    events (avg/stddev):           892.1250/0.33
    execution time (avg/stddev):   10.0082/0.00