Lockless_CAS_Optimization/artifact_files/benchmark_results/writeback_opt0_t16_r2_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     1286.35
    fsyncs/s:                     1286.35

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               20.10

General statistics:
    total time:                          10.0089s
    total number of events:              12880

Latency (ms):
         min:                                    4.70
         avg:                                   12.43
         max:                                  116.53
         95th percentile:                       20.37
         sum:                               160060.12

Threads fairness:
    events (avg/stddev):           805.0000/0.00
    execution time (avg/stddev):   10.0038/0.00