Lockless_CAS_Optimization/artifact_files/benchmark_results/writeback_opt0_t4_r1_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     367.89
    fsyncs/s:                     367.89

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               5.75

General statistics:
    total time:                          10.0070s
    total number of events:              3683

Latency (ms):
         min:                                    4.65
         avg:                                   10.86
         max:                                   45.09
         95th percentile:                       19.65
         sum:                                40006.85

Threads fairness:
    events (avg/stddev):           920.7500/0.43
    execution time (avg/stddev):   10.0017/0.00