Lockless_CAS_Optimization/artifact_files/benchmark_results/writeback_opt1_t16_r1_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     1398.71
    fsyncs/s:                     1398.71

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               21.85

General statistics:
    total time:                          10.0104s
    total number of events:              14007

Latency (ms):
         min:                                    4.94
         avg:                                   11.43
         max:                                   48.75
         95th percentile:                       16.41
         sum:                               160057.49

Threads fairness:
    events (avg/stddev):           875.4375/0.50
    execution time (avg/stddev):   10.0036/0.00