Lockless_CAS_Optimization/artifact_files/benchmark_results/writeback_opt1_t1_r2_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     158.12
    fsyncs/s:                     158.12

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               2.47

General statistics:
    total time:                          10.0010s
    total number of events:              1582

Latency (ms):
         min:                                    3.10
         avg:                                    6.32
         max:                                   73.75
         95th percentile:                       13.95
         sum:                                 9993.97

Threads fairness:
    events (avg/stddev):           1582.0000/0.00
    execution time (avg/stddev):   9.9940/0.00